# Project 3 - Part 1

In [65]:
import pandas as pd
import numpy as np
import matplotlib as plt

In [66]:
basic_gz = 'https://datasets.imdbws.com/title.basics.tsv.gz'
ratings_gz = 'https://datasets.imdbws.com/title.ratings.tsv.gz'
akas_gz = 'https://datasets.imdbws.com/title.akas.tsv.gz'

In [67]:
basics = pd.read_csv(basic_gz, sep='\t', low_memory=False)
ratings = pd.read_csv(ratings_gz, sep='\t', low_memory=False)
akas = pd.read_csv(akas_gz, sep='\t', low_memory=False)

**Basics DF Data Cleanse**

In [68]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,\N,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,\N,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,\N,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,\N,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,\N,1,"Comedy,Short"

In [69]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9294674 entries, 0 to 9294673
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 638.2+ MB

In [70]:
# replacing null values with np.nan
basics = basics.replace({'\\N':np.nan})
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0000001,short,Carmencita,Carmencita,0,1894,NaN,1,"Documentary,Short"
1,tt0000002,short,Le clown et ses chiens,Le clown et ses chiens,0,1892,NaN,5,"Animation,Short"
2,tt0000003,short,Pauvre Pierrot,Pauvre Pierrot,0,1892,NaN,4,"Animation,Comedy,Romance"
3,tt0000004,short,Un bon bock,Un bon bock,0,1892,NaN,12,"Animation,Short"
4,tt0000005,short,Blacksmith Scene,Blacksmith Scene,0,1893,NaN,1,"Comedy,Short"

In [71]:
# eliminate movies that are null for runtimeMinutes
basics = basics.dropna(subset=['runtimeMinutes'])
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2503277 entries, 0 to 9294673
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 191.0+ MB

In [72]:
# eliminate movies that are null for genres
basics = basics.dropna(subset=['genres'])
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2435459 entries, 0 to 9294673
Data columns (total 9 columns):
 #   Column          Dtype
---  ------          -----
 0   tconst          object
 1   titleType       object
 2   primaryTitle    object
 3   originalTitle   object
 4   isAdult         object
 5   startYear       object
 6   endYear         object
 7   runtimeMinutes  object
 8   genres          object
dtypes: object(9)
memory usage: 185.8+ MB

In [73]:
# keep only titleType==Movie
basics['titleType'].value_counts()

tvEpisode       1091670
short            579312
movie            369604
video            176031
tvMovie           88733
tvSeries          87293
tvSpecial         16797
tvMiniSeries      16280
tvShort            9431
videoGame           308
Name: titleType, dtype: int64

In [74]:
basics = basics[basics.titleType == 'movie']
basics['titleType'].value_counts()

movie    369604
Name: titleType, dtype: int64

In [75]:
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
8,tt0000009,movie,Miss Jerry,Miss Jerry,0,1894,NaN,45,Romance
570,tt0000574,movie,The Story of the Kelly Gang,The Story of the Kelly Gang,0,1906,NaN,70,"Action,Adventure,Biography"
587,tt0000591,movie,The Prodigal Son,L'enfant prodigue,0,1907,NaN,90,Drama
672,tt0000679,movie,The Fairylogue and Radio-Plays,The Fairylogue and Radio-Plays,0,1908,NaN,120,"Adventure,Fantasy"
1172,tt0001184,movie,Don Juan de Serrallonga,Don Juan de Serrallonga,0,1910,NaN,58,"Adventure,Drama"

In [76]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 369604 entries, 8 to 9294624
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          369604 non-null  object
 1   titleType       369604 non-null  object
 2   primaryTitle    369604 non-null  object
 3   originalTitle   369604 non-null  object
 4   isAdult         369604 non-null  object
 5   startYear       363690 non-null  object
 6   endYear         0 non-null       object
 7   runtimeMinutes  369604 non-null  object
 8   genres          369604 non-null  object
dtypes: object(9)
memory usage: 28.2+ MB

In [77]:
# keep startYear 2000-2022
basics = basics.dropna(subset=['startYear'])
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 363690 entries, 8 to 9294624
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          363690 non-null  object
 1   titleType       363690 non-null  object
 2   primaryTitle    363690 non-null  object
 3   originalTitle   363690 non-null  object
 4   isAdult         363690 non-null  object
 5   startYear       363690 non-null  object
 6   endYear         0 non-null       object
 7   runtimeMinutes  363690 non-null  object
 8   genres          363690 non-null  object
dtypes: object(9)
memory usage: 27.7+ MB

In [79]:
basics['startYear'] = basics['startYear'].astype(int)
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 363690 entries, 8 to 9294624
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          363690 non-null  object
 1   titleType       363690 non-null  object
 2   primaryTitle    363690 non-null  object
 3   originalTitle   363690 non-null  object
 4   isAdult         363690 non-null  object
 5   startYear       363690 non-null  int32
 6   endYear         0 non-null       object
 7   runtimeMinutes  363690 non-null  object
 8   genres          363690 non-null  object
dtypes: int32(1), object(8)
memory usage: 26.4+ MB

In [80]:
basics = basics.drop(basics[basics['startYear']<2000].index)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
13079,tt0013274,movie,Istoriya grazhdanskoy voyny,Istoriya grazhdanskoy voyny,0,2021,NaN,133,Documentary
34792,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
61094,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
66309,tt0067683,movie,Workers '71: Nothing About Us Without Us,Robotnicy 1971 - Nic o nas bez nas,0,2006,NaN,47,Documentary
67640,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama

In [81]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 217654 entries, 13079 to 9294624
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          217654 non-null  object
 1   titleType       217654 non-null  object
 2   primaryTitle    217654 non-null  object
 3   originalTitle   217654 non-null  object
 4   isAdult         217654 non-null  object
 5   startYear       217654 non-null  int32
 6   endYear         0 non-null       object
 7   runtimeMinutes  217654 non-null  object
 8   genres          217654 non-null  object
dtypes: int32(1), object(8)
memory usage: 15.8+ MB

In [84]:
# Eliminate movies that include "Documentary" in genre
documentary_pos = basics['genres'].str.contains('documentary',case=False)
basics = basics[~documentary_pos]
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34792,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
61094,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
67640,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
77934,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
86770,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

In [86]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 144164 entries, 34792 to 9294523
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          144164 non-null  object
 1   titleType       144164 non-null  object
 2   primaryTitle    144164 non-null  object
 3   originalTitle   144164 non-null  object
 4   isAdult         144164 non-null  object
 5   startYear       144164 non-null  int32
 6   endYear         0 non-null       object
 7   runtimeMinutes  144164 non-null  object
 8   genres          144164 non-null  object
dtypes: int32(1), object(8)
memory usage: 10.4+ MB

In [87]:
# Keep only US movies
keepers = basics['tconst'].isin(akas['titleId'])
keepers

34792      True
61094      True
67640      True
77934      True
86770      True
           ...
9294346    True
9294355    True
9294394    True
9294439    True
9294523    True
Name: tconst, Length: 144164, dtype: bool

In [100]:
basics = basics[keepers]
basics.head()

C:\Users\chris\AppData\Local\Temp\ipykernel_24100\1988747261.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  basics = basics[keepers]

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
34792,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
61094,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
67640,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
77934,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
86770,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

In [92]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 143495 entries, 34792 to 9294523
Data columns (total 9 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   tconst          143495 non-null  object
 1   titleType       143495 non-null  object
 2   primaryTitle    143495 non-null  object
 3   originalTitle   143495 non-null  object
 4   isAdult         143495 non-null  object
 5   startYear       143495 non-null  int32
 6   endYear         0 non-null       object
 7   runtimeMinutes  143495 non-null  object
 8   genres          143495 non-null  object
dtypes: int32(1), object(8)
memory usage: 10.4+ MB

**AKA's DF Data Cleanse**

In [94]:
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,\N,imdbDisplay,\N,0
1,tt0000001,2,Carmencita,DE,\N,\N,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,\N,imdbDisplay,\N,0
3,tt0000001,4,Καρμενσίτα,GR,\N,imdbDisplay,\N,0
4,tt0000001,5,Карменсита,RU,\N,imdbDisplay,\N,0

In [95]:
akas.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33475127 entries, 0 to 33475126
Data columns (total 8 columns):
 #   Column           Dtype
---  ------           -----
 0   titleId          object
 1   ordering         int64
 2   title            object
 3   region           object
 4   language         object
 5   types            object
 6   attributes       object
 7   isOriginalTitle  object
dtypes: int64(1), object(7)
memory usage: 2.0+ GB

In [96]:
# Replace "\N" with np.nan
akas = akas.replace({'\\N':np.nan})
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
0,tt0000001,1,Карменсіта,UA,NaN,imdbDisplay,NaN,0
1,tt0000001,2,Carmencita,DE,NaN,NaN,literal title,0
2,tt0000001,3,Carmencita - spanyol tánc,HU,NaN,imdbDisplay,NaN,0
3,tt0000001,4,Καρμενσίτα,GR,NaN,imdbDisplay,NaN,0
4,tt0000001,5,Карменсита,RU,NaN,imdbDisplay,NaN,0

In [98]:
# keep only US movies
akas['region'].value_counts()

JP    3998102
FR    3996952
DE    3980169
IN    3928289
ES    3920083
       ...
CC          1
TV          1
NU          1
PW          1
NR          1
Name: region, Length: 247, dtype: int64

In [102]:
akas = akas.dropna(subset=['region'])
akas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 31610144 entries, 0 to 33475125
Data columns (total 8 columns):
 #   Column           Dtype
---  ------           -----
 0   titleId          object
 1   ordering         int64
 2   title            object
 3   region           object
 4   language         object
 5   types            object
 6   attributes       object
 7   isOriginalTitle  object
dtypes: int64(1), object(7)
memory usage: 2.1+ GB

In [103]:
is_us = akas['region'].str.contains('US',case=False)
akas = akas[is_us]
akas.head()

,titleId,ordering,title,region,language,types,attributes,isOriginalTitle
5,tt0000001,6,Carmencita,US,NaN,imdbDisplay,NaN,0
14,tt0000002,7,The Clown and His Dogs,US,NaN,NaN,literal English title,0
33,tt0000005,10,Blacksmith Scene,US,NaN,imdbDisplay,NaN,0
36,tt0000005,1,Blacksmithing Scene,US,NaN,alternative,NaN,0
41,tt0000005,6,Blacksmith Scene #1,US,NaN,alternative,NaN,0

In [104]:
akas.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1359470 entries, 5 to 33474871
Data columns (total 8 columns):
 #   Column           Non-Null Count    Dtype
---  ------           --------------    -----
 0   titleId          1359470 non-null  object
 1   ordering         1359470 non-null  int64
 2   title            1359470 non-null  object
 3   region           1359470 non-null  object
 4   language         3690 non-null     object
 5   types            964635 non-null   object
 6   attributes       45162 non-null    object
 7   isOriginalTitle  1358095 non-null  object
dtypes: int64(1), object(7)
memory usage: 93.3+ MB

**Ratings DF Data Clease**

In [105]:
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1920
1  tt0000002            5.8       260
2  tt0000003            6.5      1726
3  tt0000004            5.6       173
4  tt0000005            6.2      2542

In [109]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1237493 entries, 0 to 1237492
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1237493 non-null  object
 1   averageRating  1237493 non-null  float64
 2   numVotes       1237493 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.3+ MB

In [110]:
# Keep only US movies
keepers1 = ratings['tconst'].isin(akas['titleId'])
keepers1

0           True
1           True
2          False
3          False
4           True
           ...
1237488    False
1237489     True
1237490    False
1237491    False
1237492    False
Name: tconst, Length: 1237493, dtype: bool

In [113]:
ratings = ratings[keepers1]
ratings.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1920
1  tt0000002            5.8       260
4  tt0000005            6.2      2542
5  tt0000006            5.1       175
6  tt0000007            5.4       796

In [114]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 471668 entries, 0 to 1237489
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         471668 non-null  object
 1   averageRating  471668 non-null  float64
 2   numVotes       471668 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 14.4+ MB